SimKT/ESP32-Fast-FTP/ESP32FastFTP/ESP32FastFTP.cpp

/*
 * Fast FTP SERVER FOR ESP32
 * based on FTP Server for Arduino Due and Ethernet shield (W5100) or WIZ820io
 * (W5200)
 * based on Jean-Michel Gallego's work
 * modified to work with ESP by SimKT
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "ESP32FastFTP.h"
#include <WiFi.h>
#include <WiFiClient.h>
/*
#include "driver/sdmmc_host.h"
#include "driver/sdspi_host.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_vfs.h"
#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
*/

char buf[FTP_BUF_SIZE];

WiFiServer ftpServer(FTP_CTRL_PORT);
WiFiServer dataServer(FTP_DATA_PORT_PASV);
int filee; // helper low lever file pointer

void FtpServer::initSD() {
  ESP_LOGI(TAG, "Initializing SD card");

  ESP_LOGI(TAG, "Using SPI peripheral");

  sdmmc_host_t host = SDSPI_HOST_DEFAULT();
  sdspi_slot_config_t slot_config = SDSPI_SLOT_CONFIG_DEFAULT();
  slot_config.gpio_miso = GPIO_NUM_19;
  slot_config.gpio_mosi = GPIO_NUM_23;
  slot_config.gpio_sck = GPIO_NUM_18;
  slot_config.gpio_cs = GPIO_NUM_5;
  // This initializes the slot without card detect (CD) and write protect (WP)
  // signals.
  // Modify slot_config.gpio_cd and slot_config.gpio_wp if your board has these
  // signals.

  esp_log_level_set("*", ESP_LOG_VERBOSE);
  // Options for mounting the filesystem.
  // If format_if_mount_failed is set to true, SD card will be partitioned and
  // formatted in case when mounting fails.

  esp_vfs_fat_sdmmc_mount_config_t mount_config = {
      .format_if_mount_failed = false,
      .max_files = 10,
      .allocation_unit_size = 16 * 1024};

  // Use settings defined above to initialize SD card and mount FAT filesystem.
  // Note: esp_vfs_fat_sdmmc_mount is an all-in-one convenience function.
  // Please check its source code and implement error recovery when developing
  // production applications.
  sdmmc_card_t *card;
  esp_err_t ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config,
                                          &mount_config, &card);

  if (ret != ESP_OK) {
    if (ret == ESP_FAIL) {
      ESP_LOGE(TAG, "Failed to mount filesystem. "
                    "If you want the card to be formatted, set "
                    "format_if_mount_failed = true.");
    } else {
      ESP_LOGE(TAG, "Failed to initialize the card (%s). "
                    "Make sure SD card lines have pull-up resistors in place.",
               esp_err_to_name(ret));
    }
    return;
  }
  // Card has been initialized, print its properties
  sdmmc_card_print_info(stdout, card);
  cmdStatus = -1;
}
void FtpServer::initSD_MMC() {
  ESP_LOGI(TAG, "Initializing SD card");

  ESP_LOGI(TAG, "Using SDMMC peripheral");
  sdmmc_host_t host = SDMMC_HOST_DEFAULT();

  // This initializes the slot without card detect (CD) and write protect (WP)
  // signals.
  // Modify slot_config.gpio_cd and slot_config.gpio_wp if your board has these
  // signals.
  sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();

  // To use 4-line SD mode, comment the following line:
  slot_config.width = 1;

  // GPIOs 15, 2, 4, 12, 13 should have external 10k pull-ups.
  // Internal pull-ups are not sufficient. However, enabling internal pull-ups
  // does make a difference some boards, so we do that here.
  gpio_set_pull_mode(GPIO_NUM_15,
                     GPIO_PULLUP_ONLY); // CMD, needed in 4- and 1- line modes
  gpio_set_pull_mode(GPIO_NUM_2,
                     GPIO_PULLUP_ONLY); // D0, needed in 4- and 1-line modes
  gpio_set_pull_mode(GPIO_NUM_4,
                     GPIO_PULLUP_ONLY); // D1, needed in 4-line mode only
  gpio_set_pull_mode(GPIO_NUM_12,
                     GPIO_PULLUP_ONLY); // D2, needed in 4-line mode only
  gpio_set_pull_mode(GPIO_NUM_13,
                     GPIO_PULLUP_ONLY); // D3, needed in 4- and 1-line modes
  host.max_freq_khz = 40000;

  esp_log_level_set("*", ESP_LOG_VERBOSE);
  // Options for mounting the filesystem.
  // If format_if_mount_failed is set to true, SD card will be partitioned and
  // formatted in case when mounting fails.

  esp_vfs_fat_sdmmc_mount_config_t mount_config = {
      .format_if_mount_failed = false,
      .max_files = 10,
      .allocation_unit_size = 16 * 1024};

  // Use settings defined above to initialize SD card and mount FAT filesystem.
  // Note: esp_vfs_fat_sdmmc_mount is an all-in-one convenience function.
  // Please check its source code and implement error recovery when developing
  // production applications.
  sdmmc_card_t *card;
  esp_err_t ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config,
                                          &mount_config, &card);

  if (ret != ESP_OK) {
    if (ret == ESP_FAIL) {
      ESP_LOGE(TAG, "Failed to mount filesystem. "
                    "If you want the card to be formatted, set "
                    "format_if_mount_failed = true.");
    } else {
      ESP_LOGE(TAG, "Failed to initialize the card (%s). "
                    "Make sure SD card lines have pull-up resistors in place.",
               esp_err_to_name(ret));
    }
    return;
  }
  // Card has been initialized, print its properties
  sdmmc_card_print_info(stdout, card);
  cmdStatus = -1;
}
void FtpServer::configPassiveIP(IPAddress cfg) {
  customDataIP = true;
  cdataIP = cfg;
}

void FtpServer::abortSecondClient() {
  tempClient = ftpServer.available();
  if (tempClient) {
    tempClient.println("425 bye");
    tempClient.stop();
  }
}

void FtpServer::beginFTP(String Username, String Password, uint16_t port,
                         uint16_t dataPort) {
  if (cmdStatus == -2) {
#ifdef FTP_DEBUG
    Serial.println("Ypu have to initialize the SD card first either with "
                   ".initSD if you have SPI interface or .initSD_MMC for MMC "
                   "interface");
#endif
    return;
  }

  // Tells the ftp server to begin listening for incoming connection
  _FTP_USER = Username;
  _FTP_PASS = Password;

