SimKT/ESP32-Fast-FTP/ESP32FastFTP/ESP32FastFTP.cpp
  this->dataPort = dataPort;
  Port = port;
  ftpServer.begin(port);
  delay(10);
  dataServer.begin(dataPort);
  delay(10);
  millisTimeOut = (uint32_t)FTP_TIME_OUT * 1 * 1000;
  millisDelay = 0;
  cmdStatus = 0;
  iniVariables();
}

void FtpServer::iniVariables() {
  // Default for data port
  dataPort = FTP_DATA_PORT_PASV;

  // Default Data connection is Active
  dataPassiveConn = true;

  // Set the root directory
  strcpy(cwdName, "/");

  rnfrCmd = false;
  transferStatus = 0;
}

void FtpServer::handleFTP() {

  if (millisDelay > millis()) {
    delay(10);
    return;
  }

  if (cmdStatus == 0) {
    if (client && client.connected())
      disconnectClient();
    cmdStatus = 1;
  } else if (cmdStatus == 1) // Ftp server waiting for connection
  {
    abortTransfer();
    iniVariables();
#ifdef FTP_DEBUG
    Serial.println("Ftp server waiting for connection on port " + String(Port));
#endif
    cmdStatus = 2;

  } else if (cmdStatus == 2) // Ftp server idle
  {

    if (!client || !client.connected())
      client = ftpServer.available();

    if (client.connected()) // A client connected
    {
      clientConnected();
#ifdef FTP_DEBUG
      Serial.println("connected");
#endif
      millisEndConnection = millis() + 10 * 1000; // wait client id during 10 s.
      cmdStatus = 3;
      delay(300);
    }
  } else if (readChar() > 0) // got response
  {
    if (cmdStatus == 3) // Ftp server waiting for user identity
      if (userIdentity())
        cmdStatus = 4;
      else
        cmdStatus = 0;
    else if (cmdStatus == 4) // Ftp server waiting for user registration
      if (userPassword()) {
        cmdStatus = 5;
        millisEndConnection = millis() + millisTimeOut;
      } else
        cmdStatus = 0;
    else if (cmdStatus == 5) // Ftp server waiting for user command
      if (!processCommand())
        cmdStatus = 0;
      else
        millisEndConnection = millis() + millisTimeOut;
  } else if (!client.connected() || !client) {
    cmdStatus = 1;
#ifdef FTP_DEBUG
    Serial.println("client disconnected");
#endif
  }

  if (transferStatus == 1) // Retrieve data
  {
    if (!doRetrieve())
      transferStatus = 0;
  } else if (transferStatus == 2) // Store data
  {
    if (!doStore())
      transferStatus = 0;
  } else if (cmdStatus >= 3 && (!client || !client.connected())) {
    cmdStatus = 0;
  } else if (cmdStatus > 2 &&
             !((int32_t)(millisEndConnection - millis()) > 0)) {
    if (!client || !client.connected()) {
      client.println("530 Timeout");
      millisDelay = millis() + 200; // delay of 200 ms
      cmdStatus = 0;

    } else {
      tempClient = ftpServer.available();
      if (tempClient) {

        client.println("530 Timeout");
        millisDelay = millis() + 200; // delay of 200 ms
        cmdStatus = 1;
        client = tempClient;
      } else
        millisEndConnection += millisTimeOut;
    }
  }
}

void FtpServer::clientConnected() {
#ifdef FTP_DEBUG
  Serial.println("Client connected!");
#endif
  client.println("220 Hello from FTP. Enter User");
  CMDlen = 0;
}

void FtpServer::disconnectClient() {
#ifdef FTP_DEBUG
  Serial.println(" Disconnecting client");
#endif
  abortTransfer();
  client.println("221 Goodbye");
  client.stop();
}

boolean FtpServer::userIdentity() {
  if (strcmp(command, "USER"))
    client.println("500 Syntax error");
  if (strcmp(parameters, _FTP_USER.c_str()))
    client.println("530 user not found");
  else {
    client.println("331 OK. Password required");
    strcpy(cwdName, "/");
    return true;
  }
  millisDelay = millis() + 100; // delay of 100 ms
  return false;
}

boolean FtpServer::userPassword() {
  if (strcmp(command, "PASS"))
    client.println("500 Syntax error");
  else if (strcmp(parameters, _FTP_PASS.c_str()))
    client.println("530 ");
  else {
#ifdef FTP_DEBUG
    Serial.println("OK. Waiting for commands.");
#endif
    client.println("230 OK.");
    return true;
  }
  millisDelay = millis() + 100; // delay of 100 ms
  return false;
}

boolean FtpServer::processCommand() {
  ///////////////////////////////////////
  //                                   //
  //      ACCESS CONTROL COMMANDS      //
  //                                   //
  ///////////////////////////////////////

  //
  //  CDUP - Change to Parent Directory
  //
  if (!strcmp(command, "CDUP")) {
#ifdef FTP_DEBUG
    Serial.println("CDUP ");
#endif
    int k = strlen(cwdName);
    if (k > 1) {
      cwdName[--k] = 0;
      while (cwdName[k] != '/') {
        cwdName[k--] = 0;
      }
    }
    if (k > 1)
      cwdName[k] = 0;
    client.println("250 Ok. Current directory is " + String(cwdName));
  }
  //
  //  CWD - Change Working Directory
  //
  else if (!strcmp(command, "CWD")) {
    char path[FTP_CWD_SIZE];
    Serial.println(parameters);
    if (strcmp(parameters, ".") == 0) // 'CWD .' is the same as PWD command
      client.println("257 \"" + String(cwdName) +
                     "\" is your current directory");
    else if (strncmp(parameters, "\..", 3) ==
             0) // 'CWD .' is the same as PWD command
      client.println("550 invalid directory");
    else {
      if (makePath(path))
        strcpy(cwdName, path);
      myFile root;
      root.open(cwdName);
      if (!root) {
        client.println("550 Can't open directory " + String(cwdName));
        // return;
      } else if (!root.isDirectory()) {
        client.println("550 Can't open directory " + String(cwdName));
#ifdef FTP_DEBUG
        Serial.println("Not a directory");
#endif
        // root.close()

      } else
        client.println("250 Ok. Current directory is " + String(cwdName));
    }
  }
  //
  //  PWD - Print Directory
  //
  else if (!strcmp(command, "PWD"))
    client.println("257 \"" + String(cwdName) + "\" is your current directory");
  //
  //  QUIT
  //
  else if (!strcmp(command, "QUIT") || !strcmp(command, "EXIT") ||
           !strcmp(command, "BYE")) {
    disconnectClient();
    return false;
  }

  ///////////////////////////////////////
  //                                   //
  //    TRANSFER PARAMETER COMMANDS    //
  //                                   //
  ///////////////////////////////////////

  //
  //  MODE - Transfer Mode
  //
  else if (!strcmp(command, "MODE")) {
    if (!strcmp(parameters, "S"))
      client.println("200 S Ok");
    // else if( ! strcmp( parameters, "B" ))
    //  client.println( "200 B Ok\r\n";
    else
      client.println("504 Only S(tream) is suported");
  }
  //
  //  PASV - Passive Connection management
  //
  else if (!strcmp(command, "PASV")) {
    // if (data) data.stop();
    dataIP = client.localIP();
    if (customDataIP == false)
      this->cdataIP = client.localIP();

