SimKT/ESP32-Fast-FTP/ESP32FastFTP/ESP32FastFTP.cpp
// data = dataServer.available();
#ifdef FTP_DEBUG
    Serial.println("Connection management set to passive");
    Serial.println("Data port set to " + String(dataPort));
#endif
    client.println("227 Entering Passive Mode (" + String(cdataIP[0]) + "," +
                   String(cdataIP[1]) + "," + String(cdataIP[2]) + "," +
                   String(cdataIP[3]) + "," + String(dataPort >> 8) + "," +
                   String(dataPort & 255) + ").");
    dataPassiveConn = true;
  }
  //
  //  PORT - Data Port
  //
  else if (!strcmp(command, "PORT")) {
    if (data)
      data.stop();
    // get IP of data client
    client.println("501 Can't interpret parameters");
    return true; // implementation not supported/ breaks forwarded ports
    /*
    dataIp[ 0 ] = atoi( parameters );
    char * p = strchr( parameters, ',' );
    for( uint8_t i = 1; i < 4; i ++ )
    {
      dataIp[ i ] = atoi( ++ p );
      p = strchr( p, ',' );
    }
    // get port of data client
    dataPort = 256 * atoi( ++ p );
    p = strchr( p, ',' );
    dataPort += atoi( ++ p );
    if( p == NULL )
      client.println( "501 Can't interpret parameters");
    else
    {

                client.println("200 PORT command successful");
      dataPassiveConn = false;
    }
    */
  }
  //
  //  STRU - File Structure
  //
  else if (!strcmp(command, "STRU")) {
    if (!strcmp(parameters, "F"))
      client.println("200 F Ok");
    // else if( ! strcmp( parameters, "R" ))
    //  client.println( "200 B Ok\r\n";
    else
      client.println("504 Only F(ile) is suported");
  }
  //
  //  TYPE - Data Type
  //
  else if (!strcmp(command, "TYPE")) {
    if (!strcmp(parameters, "A"))
      client.println("200 TYPE is now ASII");
    else if (!strcmp(parameters, "I"))
      client.println("200 TYPE is now 8-bit binary");
    else
      client.println("504 Unknow TYPE");
  }

  ///////////////////////////////////////
  //                                   //
  //        FTP SERVICE COMMANDS       //
  //                                   //
  ///////////////////////////////////////

  //
  //  ABOR - Abort
  //
  else if (!strcmp(command, "ABOR")) {
    abortTransfer();
    client.println("226 Data connection closed");
#ifdef FTP_DEBUG
    Serial.println("226 Data connection closed");
#endif
  }
  //
  //  DELE - Delete a File
  //
  else if (!strcmp(command, "DELE")) {
    char path[FTP_CWD_SIZE];
    if (strlen(parameters) == 0)
      client.println("501 No file name");
    else if (makePath(path)) {
      if (!file.exists(path))
        client.println("550 File " + String(parameters) + " not found");
      else {
        if (file.remove(path))
          client.println("250 Deleted " + String(parameters));
        else
          client.println("450 Can't delete " + String(parameters));
      }
    }
  }
  //
  //  LIST - List
  //

  else if (!strcmp(command, "LIST")) {
    if (!dataConnect())
      client.println("425 No data connection");
    else {
      client.println("150 Accepted data connection");
      uint16_t nm = 0;
      myFile root;
      root.open(&cwdName[0]);
      if (!(root.isDirectory())) {
        client.println("550 Can't open directory " + String(cwdName));
      } else {
        struct dirent *de = root.openNextFile();
        while (de) {
          if (de->d_type == DT_DIR) {
            data.println("drwxr-xr-x 1 ftp ftp              0 Feb 1 11:11 " +
                         String(de->d_name));
            // Serial.print("  DIR : ");
            nm++;
            // Serial.println(file.name());
          } else {
            char path[FTP_CWD_SIZE];
            makePath(path, de->d_name);
            myFile temp;
            temp.open(path, "r");
            data.print("-r--r--r-- 1 ftp ftp\t" + String(temp.size()) +
                       " Sep 30  2017 ");
            data.println(String(de->d_name));
            temp.close();
            nm++;
          }

          de = root.openNextFile("r");
        }
        client.println("226-options: -a -l");
        client.println("226 " + String(nm) + " matches total");
      }
      data.stop();
    }
  }
  //
  //  MLSD - Listing for Machine Processing (see RFC 3659)
  //

  else if ((!strcmp(command, "MLSD"))) {
    if (!dataConnect())
      client.println("425 No data connection MLSD");
    else {
      client.println("150 Accepted data connection");
      uint16_t nm = 0;
      myFile root;
      root.open(&cwdName[0]);
      if (!(root.isDirectory())) {
        client.println("550 Can't open directory " + String(cwdName));
        // return;
      } else {
        // Serial.println(root.name());
        struct dirent *de = root.openNextFile();
        while (de) {
          if (de->d_type == DT_DIR) {

            data.println("type=dir;modify=20000101160656; " +
                         String(de->d_name));
            // Serial.print("  DIR : ");
            // Serial.println(file.name());
            nm++;
          } else {
            char path[FTP_CWD_SIZE];
            makePath(path, de->d_name);
            myFile temp;
            temp.open(path, "r");
            data.println("type=file;size=" + String(temp.size()) + ";" +
                         "modify=20000101160656; " + String(de->d_name));
            temp.close();
            nm++;
          }
          de = root.openNextFile();
        }
        client.println("226-options: -a -l");
        client.println("226 " + String(nm) + " matches total");
        // }

        data.stop();
      }
    }
  }
  //
  //  NLST - Name List
  //
  else if (!strcmp(command, "NLST")) {
    if (!dataConnect())
      client.println("425 No data connection");
    else {
      client.println("150 Accepted data connection");
      uint16_t nm = 0;

      myFile root;
      root.open(cwdName);
      if (!(root.isDirectory())) {
        client.println("550 Can't open directory " + String(cwdName));
        // return;
      } else {
        struct dirent *de = root.openNextFile();
        while (de) {
          if (de->d_type == DT_DIR) {
            data.println(String(de->d_name));
            // Serial.print("  DIR : ");
            nm++;
            // Serial.println(file.name());

          } else {
            data.println(String(de->d_name));
            nm++;
          }

