SimKT/ESP32-Fast-FTP/ESP32FastFTP/ESP32FastFTP.cpp
          de = root.openNextFile("r");
        }
        //	client.println( "226-options: -a -l");
        client.println("226 " + String(nm) + " matches total");
      }
      data.stop();
    }
  }
  //
  //  NOOP
  //
  else if (!strcmp(command, "NOOP")) {
    // dataPort = 0;
    client.println("200 Ping...");
  }
  //
  //  RETR - Retrieve
  else if (!strcmp(command, "REST")) {
    // dataPort = 0;
    client.println("350 Rest supported. Restarting at " + String(parameters));
    seekPoint = atoll(parameters);
#ifdef FTP_DEBUG
    Serial.println("Rest supported. Restarting at " + String(parameters));
#endif
  }
  //
  else if (!strcmp(command, "RETR")) {
    char path[FTP_CWD_SIZE];
    if (strlen(parameters) == 0)
      client.println("501 No file name");
    else if (makePath(path)) {
      file.open(path, "rb");
      if (!file)
        client.println("550 File " + String(parameters) + " not found");

      else if (!dataConnect())
        client.println("425 No data connection");
      else {
#ifdef FTP_DEBUG
        Serial.println("Sending " + String(parameters));
#endif
        if (seekPoint && seekPoint < file.size()) {
          file.seek(seekPoint);
        } else
          seekPoint = 0;
        client.println("150-Connected to port " + String(dataPort));
        client.print("150 ");
        client.print(((long)(file.size()) - (long)seekPoint));
        client.println(" bytes to download");
        millisBeginTrans = millis();
        bytesTransfered = 0;
        transferStatus = 1;
        seekPoint = 0;
        filee = fileno(file._f);
        fcntl(filee, F_SETFL, fcntl(filee, F_GETFL) | O_NONBLOCK);
        // digitalWrite(LED_BUILTIN, 1);
      }
    }
  }
  //
  //  STOR - Store
  //
  else if (!strcmp(command, "STOR") || !strcmp(command, "APPE")) {
    char path[FTP_CWD_SIZE];
    if (strlen(parameters) == 0)
      client.println("501 No file name");
    else if (makePath(path)) {
      file.close();
      sprintf(buf, "%s%s", "/sdcard", path);
      if (!strcmp(command, "STOR"))
        filee = open(buf, O_WRONLY | O_CREAT | O_TRUNC | O_NONBLOCK);
      else
        filee = open(buf, O_WRONLY | O_NONBLOCK | O_APPEND);
      // file.open(path, "wb");
      if (filee == -1)
        client.println("451 Can't open/create " + String(parameters));
      else if (!dataConnect()) {
        client.println("425 No data connection");
        file.close();
      } else {
#ifdef FTP_DEBUG
        Serial.println("Receiving " + String(parameters));
#endif
        client.println("150 Connected to port " + String(dataPort));
        millisBeginTrans = millis();
        bytesTransfered = 0;
        transferStatus = 2;
        // digitalWrite(LED_BUILTIN, 1);
        // setvbuf(file._f,0,_IONBF,0);
        //  fcntl(filee, F_SETFL, fcntl(filee, F_GETFL) |_FSYNC | _FSYNC);
      }
    }
  }
  //
  //  MKD - Make Directory
  //
  else if (!strcmp(command, "MKD")) {
#ifdef FTP_DEBUG
    Serial.println("making dir " + String(parameters));
#endif
    char path[FTP_CWD_SIZE];
    if (strlen(parameters) == 0)
      client.println("550 Can't create");
    else if (makePath(path))
      if (SD.mkdir(path))
        client.println("257 " + String(path) + " created");
      else
        client.println("550 Can't create \"" +
                       String(path)); // not support on espyet
  }
  //
  //  RMD - Remove a Directory
  //
  else if (!strcmp(command, "RMD")) {
#ifdef FTP_DEBUG
    Serial.println("removing dir " + String(parameters));
#endif
    char path[FTP_CWD_SIZE];
    if (strlen(parameters) == 0)
      client.println("501 Can't delete /");
    else if (makePath(path))
      if (SD.rmdir(path))
        client.println("250 " + String(path) + " deleted");
      else
        client.println("501 Can't delete \"" + String(path));

  }
  //
  //  RNFR - Rename From
  //
  else if (!strcmp(command, "RNFR")) {
    // buf[ 0 ] = 0;
    if (strlen(parameters) == 0) {
      client.println("501 No file name");
    }

    else if (makePath(buf)) {
      if (!SD.exists(buf)) {
        client.println("550 File " + String(parameters) + " not found");
#ifdef FTP_DEBUG
        Serial.println("550 File " + String(buf) + " not found");
#endif
      }

      else {
#ifdef FTP_DEBUG
        Serial.println("Renaming " + String(buf));
#endif
        client.println(
            "350 RNFR accepted - file exists, ready for destination");
        rnfrCmd = true;
      }
    }
  }
  //
  //  RNTO - Rename To
  //
  else if (!strcmp(command, "RNTO")) {
    char path[FTP_CWD_SIZE];
    char dir[FTP_FIL_SIZE];
    if (strlen(buf) == 0 || !rnfrCmd)
      client.println("503 Need RNFR before RNTO");
    else if (strlen(parameters) == 0)
      client.println("501 No file name");
    else if (makePath(path)) {
      if (SD.exists(path))
        client.println("553 " + String(parameters) + " already exists");
      else {
#ifdef FTP_DEBUG
        Serial.println("Renaming " + String(buf) + " to " + String(path));
#endif
        if (SD.rename(buf, path))
          client.println("250 File successfully renamed or moved");
        else
          client.println("451 Rename/move failure");
      }
    }
    rnfrCmd = false;
  }

  ///////////////////////////////////////
  //                                   //
  //   EXTENSIONS COMMANDS (RFC 3659)  //
  //                                   //
  ///////////////////////////////////////

  //
  //  FEAT - New Features
  //
  else if (!strcmp(command, "FEAT")) {
    client.println("211-Extensions suported:");
    client.println(" MLSD");
    client.println(" SIZE");
    client.println(" ABOR");
    client.println(" REST");
    client.println(" UTF8");
    client.println("211 End.");
  }
  //
  //  MDTM - File Modification Time (see RFC 3659)
  //
  else if (!strcmp(command, "MDTM")) {
    client.println("502 Not Implemented");
  }

  //
  //  SIZE - Size of the file
  //
  else if (!strcmp(command, "SIZE")) {
#ifdef FTP_DEBUG
// Serial.println("Reached SIZE");
#endif
    char path[FTP_CWD_SIZE];
    if (strlen(parameters) == 0) {
      client.println("501 No file name");
#ifdef FTP_DEBUG
      Serial.println("501 No file name");
#endif
    } else if (makePath(path)) {
      if (!SD.exists(path)) {
        client.println("421 File " + String(parameters) + " does not exist");
#ifdef FTP_DEBUG
        Serial.println("421 File " + String(parameters) + " does not exist");
#endif
        client.stop();
        cmdStatus = 0;
      } else {
        SD.open(path, "r");
        if (!SD) {
          client.println("550 Can't open " + String(parameters));
#ifdef FTP_DEBUG
          client.println("550 Can't open " + String(parameters));
#endif
        } else {
          client.println("213 " + String(SD.size()));
          SD.close();
        }
      }
    }
  }
  //
  //  SITE - System command
  //
  else if (!strcmp(command, "SITE")) {
    client.println("500 Unknow SITE command " + String(parameters));
  }
  //
  //  Unrecognized commands ...
  //
  else
    client.println("500 Unknow command");

