SimKT/ESP32-Fast-FTP/ESP32FastFTP/ESP32FastFTP.cpp
  return true;
}

boolean FtpServer::dataConnect() {
  unsigned long startTime = millis();
  // wait 5 seconds for a data connection
  if (!data || !data.connected()) {
    data.stop();
    while (!dataServer.hasClient() && millis() - startTime < 5000) {
      delay(100);
      yield();
    }
    if (dataServer.hasClient()) {

      data = dataServer.available();
#ifdef FTP_DEBUG
      Serial.println("data channel connected....");
#endif
    }
  }

  return data.connected();
}

boolean FtpServer::doRetrieve() {
#ifdef FTP_DEBUG
  u_long time1 = millis(), time2, bytesLast = 0;

#endif
  while (data.connected()) {
    int32_t nb = read(fileno(file._f), buf, (size_t)FTP_BUF_SIZE);
    if (nb > 0) {
      // delay(0);
      nb = data.write((uint8_t *)buf, (size_t)nb);
#ifdef FTP_DEBUG
      if (nb <= 0)
        Serial.println("Socket err");
#endif

      abortSecondClient();
      bytesTransfered += nb;
#ifdef FTP_DEBUG
      if (millis() >= time1 + 1000) {
        time2 = millis();
        Serial.printf("\rTransfer Speed : %.3f KB/s",
                      (bytesTransfered - bytesLast) * 1000 /
                          (float)(time2 - time1) / 1024.0);
        time1 = time2;
        bytesLast = bytesTransfered;
      }
#endif
      // return true;
    } else
      break;
  }
  millisEndConnection = millis() + millisTimeOut;
  closeTransfer();
#ifdef FTP_DEBUG
  Serial.println("\r\n Transfer Completed(or stopped)");
#endif
  // digitalWrite(LED_BUILTIN, 0);
  return false;
}

boolean FtpServer::doStore() {
  // Avoid blocking by never reading more bytes than are available
  int16_t nb;
  long timeout;
  long pos = 0;
  while (data && data.connected()) {
    int32_t nb = data.available();
    if (FTP_BUF_SIZE < nb + pos)
      nb = FTP_BUF_SIZE - pos;
    delay(1);
    if (nb > 0) {
      nb = data.read((uint8_t *)&buf[pos], nb);
      if (nb > 0) {
        pos += nb;
        if (pos >= FTP_BUF_SIZE) {
          // file.wwrite((uint8_t*)buf, pos);
          // fflush(file._f);
          write(filee, buf, (size_t)pos);

          // fsync(filee);
          // fwrite(&buf[0],(size_t)1,(size_t)pos,file._f);
          // fflush(file._f);
          // fflush(filee);
          pos = 0;
        }
        // abortSecondClient();
        bytesTransfered += nb;
      }
      // return true;
    } // else break;
  }
  delay(10);
  if (pos)
    write(filee, buf, (size_t)pos);
  // fsync(filee);
  // fwrite(&buf[0],(size_t)1,(size_t)pos,file._f);
  // fflush(file._f);
  // fflush(filee);
  delay(10);
  close(filee);
  millisEndConnection = millis() + millisTimeOut;
  closeTransfer();
  // digitalWrite(LED_BUILTIN, 0);
  return false;
}

void FtpServer::closeTransfer() {
  uint32_t deltaT = (int32_t)(millis() - millisBeginTrans);
  if (deltaT > 0 && bytesTransfered > 0) {
    client.println("226-File successfully transferred");
    client.println("226 " + String(deltaT) + " ms, " +
                   String(bytesTransfered / deltaT) + " kbytes/s");
  } else
    client.println("226 File successfully transferred");

  if (file)
    file.close();
  if (data)
    data.stop();
}

void FtpServer::abortTransfer() {
  if (transferStatus > 0) {
    if (file)
      file.close();
    if (data)
      data.stop();
    client.println("426 Transfer aborted");
#ifdef FTP_DEBUG
    Serial.println("Transfer aborted!");
#endif
  }
  transferStatus = 0;
}

// Read a char from client connected to ftp server
//
//  update cmdLine and command buffers, CMDlen and parameters pointers
//
//  return:
//    -2 if buffer cmdLine is full
//    -1 if line not completed
//     0 if empty line received
//    length of cmdLine (positive) if no empty line received

int16_t FtpServer::readChar() {
  int16_t rc = -1;

  if (client.available()) {
    char c = client.read();

#ifdef FTP_DEBUG
    Serial.print(c);
#endif
    // if( c == '\\' )
    //    c = '/';
    if (c != '\r')
      if (c != '\n') {
        if (CMDlen < FTP_CMD_SIZE)
          cmdLine[CMDlen++] = c;
        else {
          rc = -2;
#ifdef FTP_DEBUG
          Serial.print("Line too long");
#endif
        } //  Line too long
      } else {
        cmdLine[CMDlen] = 0;
        command[0] = 0;
        parameters = NULL;
        // empty line?
        if (CMDlen == 0) {
          Serial.println("empty line?");
          rc = 0;
        }

        else {
          rc = CMDlen;
          // search for space between command and parameters
          parameters = strchr(cmdLine, ' ');
          if (parameters != NULL) {
            if (parameters - cmdLine > 4) {
              rc = -2; // Syntax error
#ifdef FTP_DEBUG
              Serial.print("Syntax error");
#endif

            }

            else {
              strncpy(command, cmdLine, parameters - cmdLine);
              command[parameters - cmdLine] = 0;

              while (*(++parameters) == ' ')
                ;
#ifdef FTP_DEBUG
// Serial.println(String("Kom0 :")+String(command)+" "+String(parameters));

#endif
            }
          } else if (strlen(cmdLine) > 4) {
            strcpy(command, cmdLine + strlen(cmdLine) - 4);
          }

          else {
            strcpy(command, cmdLine);
#ifdef FTP_DEBUG
// Serial.print( String("Kom :")+String(command));
#endif
          }

          CMDlen = 0;
        }
      }
    if (rc > 0) {
      for (uint8_t i = 0; i < strlen(command); i++)
        command[i] = toupper(command[i]);
#ifdef FTP_DEBUG
      Serial.println(String("Command :") + String(command) + " " +
                     String(parameters));
#endif
    }

    if (rc == -2) {
      CMDlen = 0;
      client.println("500 Syntax error");
    }
  }
  return rc;
}

// Make complete path/name from cwdName and parameters
//
// 3 possible cases: parameters can be absolute path, relative path or only the
// name
//
// parameters:
//   fullName : where to store the path/name
//
// return:
//    true, if done

boolean FtpServer::makePath(char *fullName) {
  return makePath(fullName, parameters);
}

boolean FtpServer::makePath(char *fullName, char *param) {
  if (param == NULL)
    param = parameters;

  // Root or empty?
  if (strcmp(param, "/") == 0 || strlen(param) == 0) {
    strcpy(fullName, "/");
    return true;
  }
  // If relative path, concatenate with current dir
  if (param[0] != '/') {
    strcpy(fullName, cwdName);
    if (fullName[strlen(fullName) - 1] != '/')
      strncat(fullName, "/", FTP_CWD_SIZE);
    strncat(fullName, param, FTP_CWD_SIZE);
  } else
    strcpy(fullName, param);
  // If ends with '/', remove it
  uint16_t strl = strlen(fullName) - 1;
  if (fullName[strl] == '/' && strl > 1)
    fullName[strl] = 0;
#ifdef FTP_DEBUG
//	Serial.println( "FULLPATH : "+String(fullName));
#endif
  if (strlen(fullName) < FTP_CWD_SIZE)
    return true;
#ifdef FTP_DEBUG
  Serial.println("500 Command line too long");
#endif
  client.println("500 Command line too long");
  return false;
}
